







/*
在程序启动时播放
*/
void welcome(){
    system("cls");
	printf("\n\n\n\n\t\t\t\t******************************************************************\n");
	printf("\t\t\t\t++--**********************************************************--++\n");
	printf("\t\t\t\t******************************************************************\n");
	printf("\t\t\t\t++--**********************************************************--++\n");
	printf("\t\t\t\t**                     徽    州    大    学                     **\n");
	printf("\t\t\t\t********                                                   *******\n");
	printf("\t\t\t\t-------------                                        -------------\n");
	printf("\t\t\t\t******************           安徽黄山          ****************** \n");
	printf("\t\t\t\t----------------------                    ------------------------\n");
	printf("\t\t\t\t::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n");
	printf("\t\t\t\t[][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][]\n");
	printf("\t\t\t\t&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&\n");
	printf("\t\t\t\t##################################################################\n");
	printf("\t\t\t\t @  @  !  !  @  @  !  !  @  @  !  !  @  @  !  !  @  @  !  !  @  @ \n");
    Sleep(1500);
}













/*
在程序退出时播放
*/
void printfquit(){
    system("cls");
    int f;
    for (f = 1; f < 3; f++) {
    printf("\n\n\n\n\n\t\t\t\t\t退出.\n");
    Sleep(200);
    system("cls");
    printf("\n\n\n\n\n\t\t\t\t\t退出..\n");
    Sleep(200);
    system("cls");
    printf("\n\n\n\n\n\t\t\t\t\t退出...\n");
    Sleep(200);
    system("cls");
    printf("\n\n\n\n\n\t\t\t\t\t退出....\n");
    Sleep(200);
    system("cls");
    printf("\n\n\n\n\n\t\t\t\t\t退出.....\n");
    Sleep(200);
    system("cls");
    printf("\n\n\n\n\n\t\t\t\t\t退出.....\n");
    Sleep(50);
    system("cls");
    exit(0);
    }
}






/*
在此处选择进行操作的模块
程序分为两个模块{成绩管理，信息管理}
*/
void systemIn(){
    system("cls");
    printf("\n\n\n\n\t\t\t\t*******************************************\n");
    printf("\t\t\t\t*******************************************\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t***        欢迎来到学生管理系统         ***\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t***          1.学生信息管理.            ***\n");
    printf("\t\t\t\t***          2.学生成绩管理.            ***\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t***                  任意按键退出.      ***\n");
    printf("\t\t\t\t*******************************************\n");
    printf("\t\t\t\t*******************************************\n");
}





/*
选择成绩管理时播放的菜单
*/
void GradeWelcome_menu(){
    system("cls");
    printf("\n\n\n\n\t\t\t\t*******************************************\n");
    printf("\t\t\t\t*******************************************\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t***               成绩管理              ***\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t***          1.输入学生成绩.            ***\n");
    printf("\t\t\t\t***          2.查找学生成绩.            ***\n");               //用户界面
    printf("\t\t\t\t***          3.输出学生成绩.            ***\n");
    printf("\t\t\t\t***          4.排序学生成绩.            ***\n");
    printf("\t\t\t\t***          0.退出系统.                ***\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t*******************************************\n");
    printf("\t\t\t\t*******************************************\n");
}




/*
选择信息管理时播放的菜单
*/
void InformationWelcome_menu(){
    system("cls");
    printf("\n\n\n\n\t\t\t\t*******************************************\n");
    printf("\t\t\t\t*******************************************\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t***                信息管理             ***\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t***           1.输入学生信息.           ***\n");
    printf("\t\t\t\t***           2.查找学生信息.           ***\n");                //用户界面
    printf("\t\t\t\t***           3.输出学生信息.           ***\n");
    printf("\t\t\t\t***           0.退出系统.               ***\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t***                                     ***\n");
    printf("\t\t\t\t*******************************************\n");
    printf("\t\t\t\t*******************************************\n");
}